[
	{
		"id": "c67ab8a7",
		"title": "Rinding cities",
		"subtitle": "Association sportive qui promeut le skate",
		"cover": "https://www.neoglisse.fr/wp-content/uploads/2023/07/max-tarkhov-NG4684I8Bng-unsplash-min-1024x819.jpg",		
		"description": "J'ai rejoint l’agence Webonzaï pour un stage en tant que développeur junior. Ma mission était de mettre à jour la page Internet de Riding Cities, une association sportive qui promeut le skate. ",		
		"skills": [
			"HTML5",
			"CSS3"
		],
		"assignment": [
			"Créer une nouvelle section, “Les membres fondateurs”, contenant du texte et des images en colonnes avec les noms et photos des créateurs de l’association.",
			"Modifier la section comprenant le bouton “Télécharger le planning de cours” pour ajouter un titre et deux boutons permettant de télécharger deux plannings de cours différents (un pour les enfants et un pour les adultes).",
			"Rattacher les plannings de cours pour enfants et pour adultes aux boutons de téléchargement."
		],
		"resources": [
			"Mettez en place votre environnement",
			"Créer votre site web avec HTML5 et CSS3"
		]
	},

	{
		"id": "c67ab8a8",
		"title": "Agence de voyage Booki",
		"subtitle": "Site web qui permet de trouver des hébergements et des activités par la ville de son choix.",
		"cover": "https://raw.githubusercontent.com/jeanrenejaouen/portfolio/main/src/assets/images/booki.png",		
		"description": " J'ai effectué un stage en alternance en tant que développeur web au sein de la start-up Booki. Le projet était le développement du site internet de l’agence de voyage Booki permettant aux usagers de trouver des hébergements et des activités dans la ville de leur choix.  ",		
		"skills": [
			"Implémenter une interface responsive avec HTML et CSS",
			" Installer un environnement de développement front-end",
			" Intégrer du contenu conformément à une maquette avec HTML et CSS"
		],
		"assignment": [
			"Mettre en place votre environnement de développement : Visual Studio Code, Google Fonts et Font Awesome.",
			"Découper la maquette représentant la structure du code HTML.",
			"Intégrez le header du projet et utiliser Flexbox (ou Grid).",
			"Ajouter le formulaire de recherche.",
			"Ajout de la partie Filtres avec Flexbox",
			"Réaliser une première « card » présente dans «Hébergements à Marseille » (utiliser une largeur d'image en “%” et la propriété object-fit)",
			"Gérer l’affichage des “cards” du conteneur “Hébergements à Marseille” (utiliser Flexbox et une largeur d'image en “%”)",
			"Intégrer le conteneur “Activités à Marseille”",
			" Implémenter le footer avec Flexbox",
			"Mettre en place le responsive design (respecter les deux media queries définies : 1024px pour l’affichage tablette et 768px pour l’affichage mobile) "
		],
		"resources": [
			"Mettez en place votre environnement front-end",
			"Créer votre site web avec HTML5 et CSS3",
			"Corrigez vos bugs et trouvez une solution à vos problèmes de code",
			"Intégrez une maquette Figma en HTML / CSS",
			"Créez une maquette pour le développement web",
			"Créez une maquette web avec Figma "
		]
	},

	{
		"id": "c67ab8a9",
		"title": "Ohmyfood",
		"subtitle": "site web qui répertorie les menus de restaurants gastronomiques.",
		"cover": "https://github.com/jeanrenejaouen/portfolio/raw/main/src/assets/images/Ohmyfood.png",		
		"description": " J'ai intégré Ohmyfood en tant que développeur junior. Il s’agit d’une jeune startup qui voudrait s'imposer sur le marché de la restauration.Déjà présente à New-York, elle souhaite désormais faire sa place à Paris. Ma mission était de développer un site “mobile first” qui répertorie les menus de restaurants gastronomiques.   ",		
		"skills": [
			"Intégrer une maquette en mobile-first",
			"Mettre en œuvre des animations CSS soignées",
			"Versionner son projet avec Git et Github",
			"Utiliser SASS pour le style"
		],
		"assignment": [
			"Mettre en place votre environnement de développement : mettre le projet sur GitHub et créer une structure de projet contenant un dossier pour les assets, un dossier pour le SASS ou le CSS et un dossier pourles pages restaurants",
			"Intégrer la version mobile de la page d’accueil sans les animations.",
			"Ajouter les animations à la page d’accueil.",
			"Réaliser le responsive de la page d’accueil en identifiant des breakpoints standard afin d’éviter de multiplier les media queries.",
			"Intégrer le code d’une page de restaurant et valider la page au W3C pour le HTML et le CSS.",
			"Copier la page de restaurant et adapter le contenu aux restaurants restants dans tous les formats. "			
		],
		"resources": [
			"Les maquettes desktop et mobile du site Ohmyfood.",
			" Le prototype du site via Figma incluant les animations et comportements à intégrer.",
			"Les fichiers sources (images et textes)."			
		]
	},
	{
		"id": "c67ab8a10",
		"title": "Print it !",
		"subtitle": "Site web statique d’une petite imprimerie familiale.",
		"cover": "https://github.com/jeanrenejaouen/portfolio/raw/main/src/assets/images/Printit.png",		
		"description": "Comme développeur front-end débutant en freelance, j'ai décroché une offre pour dynamiser le site Internet statique d’une petite imprimerie familiale nommée Print it. ",		
		"skills": [
			"",
			"",
			"",
			""
		],
		"assignment": [
			"",
			"",
			"",
			"",
			"",
			""			
		],
		"resources": [
			"",
			"",
			""			
		]
	},
	{
		"id": "c67ab8a11",
		"title": "Sophie Buel - Architecte",
		"subtitle": "Site portfolio d’une architecte d’intérieur.",
		"cover": "https://github.com/jeanrenejaouen/portfolio/raw/main/src/assets/images/SophieBuel.png",		
		"description": "J'ai travaillé comme développeur front-end pour l’agence ArchiWebos qui comprend 50 salariés. Ayant terminé mon dernier projet avec un peu d'avance, j'ai été envoyé en renfort comme développeur front-end dans une équipe qui travaille sur la conception du site portfolio d’une architecte d’intérieur pour créer une page web dynamique avec Javascript.",		
		"skills": [
			"",
			"",
			"",
			""
		],
		"assignment": [
			"",
			"",
			"",
			"",
			"",
			""			
		],
		"resources": [
			"",
			"",
			""			
		]
	},
	{
		"id": "c67ab8a12",
		"title": "Qwenta",
		"subtitle": "Site “Menu Maker” qui permet aux restaurateurs d’afficher et de mettre en page leurs menus facilement.",
		"cover": "https://github.com/jeanrenejaouen/portfolio/raw/main/src/assets/images/qwenta.png",		
		"description": "En tant que développeur front-end au sein de l’agence Webgencia, j'ai préparé et planifié le projet de développement d’un site pour Qwenta, un de nos clients. Il s’agit d’un site “Menu Maker” permettant aux restaurateurs d’afficher et de mettre en page leurs menus facilement, en quelques clics. ",		
		"skills": [
			"",
			"",
			"",
			""
		],
		"assignment": [
			"",
			"",
			"",
			"",
			"",
			""			
		],
		"resources": [
			"",
			"",
			""			
		]
	},
	{
		"id": "c67ab8a13",
		"title": "Kasa",
		"subtitle": "Plateforme web de location d’appartements entre particuliers.",
		"cover": "https://github.com/jeanrenejaouen/portfolio/raw/main/src/assets/images/Printit.png",		
		"description": "J'ai été recruté chez Kasa en tant que développeur front-end en freelance pour développer sa nouvelle plateforme web. Kasa est dans le métier de la location d’appartements entre particuliers depuis près de 10 ans maintenant. Avec plus de 500 annonces postées chaque jour, Kasa fait partie des leaders de la location d’appartements entre particuliers en France. ",		
		"skills": [
			"",
			"",
			"",
			""
		],
		"assignment": [
			"",
			"",
			"",
			"",
			"",
			""			
		],
		"resources": [
			"",
			"",
			""			
		]
	},
	{
		"id": "c67ab8a14",
		"title": "Nina Carducci",
		"subtitle": "",
		"cover": "https://github.com/jeanrenejaouen/portfolio/raw/main/src/assets/images/Printit.png",		
		"description": "En tant que développeur freelance, j'ai décidé de proposer mes services d’optimisation SEO à de nouveaux clients.Pour ce faire, j'ai analysé plusieurs sites internet et pris contact avec les administrateurs des sites qui peuvent être optimisés pour leur proposer mes services.Parmi mes prospects, il y a le site de Nina Carducci, une photographe intéressée par ma proposition. ",		
		"skills": [
			"",
			"",
			"",
			""
		],
		"assignment": [
			"",
			"",
			"",
			"",
			"",
			""			
		],
		"resources": [
			"",
			"",
			""			
		]
	}
]